-- [[ Cryptic Hub - قسم معلومات السكربت ]]
-- المطور: يامي (@d8u_)

return function(Tab, UI)
    -- تم حذف الصورة واسم السيرفر كما طلبتِ
    
    Tab:AddLabel("👤 مطور السكربت: يامي (@d8u_) ")
    Tab:AddLabel("📅 تاريخ الإنشاء: 2026/2/27") -- تم إضافة التاريخ المطلوب
    
    Tab:AddButton("اضغط لنسخ رابط الديسكورد", function()
        setclipboard("https://discord.gg/QSvQJs7BdP")
        UI:Notify("تم نسخ الرابط بنجاح!")
    end)

    -- الرسالة الشخصية بالخط الصغير
    Tab:AddParagraph("سلام عليكم")
end
